# Вагоны в электричке пронумерованы натуральными числами, 
# начиная с 1 (при этом иногда вагоны нумеруются от «головы» 
# поезда, а иногда – с «хвоста»; это зависит от того, 
# в какую сторону едет электричка). 
# В каждом вагоне написан его номер. 
# Витя сел в i-й вагон от головы поезда и обнаружил, 
# что его вагон имеет номер j. Он хочет определить, 
# сколько всего вагонов в электричке. 
# Напишите программу, которая будет это делать или сообщать, 
# что без дополнительной информации это сделать невозможно.
head = int(input("Введите вагон, в который сел Витя :"))
tail = int(input("Введите номер вагона, в который сел Витя :"))

print(f"количество вагонов поезда {(head + tail) - 1}")  # - 1 чтобы попасть. 2 и 4 всего 6. С головы 2 с хвоста 4