# Если ты много лет подряд был воином Белой розы, если ты не раз участвовал в кровопролитных 
# битвах между индейцами и бледнолицыми, если ты, наконец, был разведчиком союзников во второй мировой войне, 
# то ты научился двум вещам: ничему не удивляться и уметь молчать, когда надо.

# Напишите программу, которая найдет отличия между индейцами и бледнолицыми 
# (или Белой розой и Красной розой, кто их разберет!).

# Из каждых двух наборов целых чисел выбрать общие, оканчивающиеся на 1 или 3, без повторений. 
# Вывести в порядке убывания через &, окруженный пробелами.

# Формат ввода
# Вводится число n – количество наборов из двух строк, в которых целые числа записаны через пробел.

# Затем 2 * n строк с целыми числами.

# Формат вывода
# Вывести n строк, в которых записаны определенные по указанному правилу числа через &, окруженный пробелами

# Ввод
# 3
# 9 28 21 23 12 41
# 6 21 18 26 41 18 23 53
# 18 4 25 31 15 20 31 1
# 2 13 10 28 12
# 10 31 23 13 121 17 9 18
# 31 9 3 10 121 4 14 21

# вывод
# 41 & 23 & 21
# 121 & 31